After the resource RI_Quantity_Needed is updated by the terraform apply command, running a terraform plan still shows the below instead of "infrastructure is up to date"

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudability_business_metric.RI_Quantity_Needed must be replaced
-/+ resource "cloudability_business_metric" "RI_Quantity_Needed" {
      - default_value            = "0" -> null # forces replacement
      ~ id                       = "2" -> (known after apply)
      ~ index                    = 2 -> (known after apply)
        name                     = "RI Quantity Needed"
      ~ updated_at               = "2023-08-04T04:29:46.886Z" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.